package bai_tap_them.b3_manage_transport3.commons;

public interface Regex {

    String REGEX_CAR = "^[0-9]{2}[AB]-[0-9]{3}.[0-9]{2}$";
    String REGEX_TRUCK = "^[0-9]{2}[C]-[0-9]{3}.[0-9]{2}$";
    String REGEX_MOTORCYCLE = "^[0-9]{2}-[A-Z][0-9]-[0-9]{3}.[0-9]{2}$";
    String REGEX_YEAR = "^[12][0-9]*$";
    String REGEX_NAME = "^[A-Za-zÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠàáâãèéêìíòóôõùúăđĩũơ" +
            "ƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂưăạảấầẩẫậắằẳẵặẹẻẽềềể" +
            "ỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễệỉịọỏốồổỗộớờởỡợụủứừ" +
            "ỬỮỰỲỴÝỶỸửữựỳỵỷỹ]+(\\s{1}[A-Za-zÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠ" +
            "àáâãèéêìíòóôõùúăđĩũơƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂ" +
            "ưăạảấầẩẫậắằẳẵặẹẻẽềềểỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪ" +
            "ễệỉịọỏốồổỗộớờởỡợụủứừỬỮỰỲỴÝỶỸửữựỳỵỷỹ]+)*$";
    String REGEX_NUMBER = "^[1-9]|([1-9][0-9]*)$";

}
