package library.commons;

public interface Regex {
    String FILE_NAME = "fileData.csv";
    String NAME_VN = "^([A-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễỬỮỰỲỴÝỶỸ][a-zàáâãèéêìíòóôõùúăđĩũơưăạảấầẩẫậắằẳẵặẹẻẽềềểễệỉịọỏốồổỗộớờởỡợụủứừửữựỳỵỷỹ]*)(\\s[A-ZÀÁÂÃÈÉÊÌÍÒÓÔÕÙÚĂĐĨŨƠƯĂẠẢẤẦẨẪẬẮẰẲẴẶẸẺẼỀỀỂỄỆỈỊỌỎỐỒỔỖỘỚỜỞỠỢỤỦỨỪễỬỮỰỲỴÝỶỸ][a-zàáâãèéêìíòóôõùúăđĩũơưăạảấầẩẫậắằẳẵặẹẻẽềềểễệỉịọỏốồổỗộớờởỡợụủứừửữựỳỵỷỹ]*)*$";
    String NAME_E = "^[A-Z]([a-z]*)+([0-9]*)$";     //      Khanh12
    String NUMBER = "^[0-9]+$";             //      int >= 0
    String INTEGER = "^-?[0-9]+$";          //      int >= 0 && int < 0
    String DOUBLE = "^[0-9]+(.[0-9]+)?$";   //      double(Ex: 1, 1.2)
    String YEAR = "^[12][0-9]{3}$";         //      từ năm 1000 > 2999
//    String YEAR = "^19[0-9][0-9]$|^20[01][0-9]$|^202[01]$";    //      từ năm 1900 > 2021
    String YEAR18 = "^19[0-9][0-9]$|^200[0-3]$";                 //      từ năm 1900 > 2013   cách năm 2021 18 năm
    String DAY = "\\d{2}[-|/]\\d{2}[-|/]\\d{4}";    //      dd/mm/yyyy hoặc dd-mm-yyyy
    String REGEX_DAY =  "^(?:(?:31(\\/)(?:0?[13578]|1[02]))\\1|(?:(?:29|30)(\\/)(?:0?[13-9]|1[0-2])\\2))(?:(?:1[6-9]|[2-9]\\d)?\\d{2})$|^(?:29(\\/)0?2\\3(?:(?:(?:1[6-9]|[2-9]\\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\\d|2[0-8])(\\/)(?:(?:0?[1-9])|(?:1[0-2]))\\4(?:(?:1[6-9]|[2-9]\\d)?\\d{2})$";
    String EMAIL = "^[a-zA-Z0-9._%+-]+@[a-zA-Z0-9.-]+\\.[a-zA-Z]{2,6}$";
    String CAPACITY = "(^[1-9]$)|(^[1][0-9]$)|(^20$)";        //      1-20   -- "^[0-9]{2}$" / 0-99
    String GENDER = "^(Male)$|^(Female)$|^(Other)$";
}
